# URLs

HOMEPAGE_URL = 'https://qa-scooter.praktikum-services.ru/'
ORDER_PAGE_URL = 'https://qa-scooter.praktikum-services.ru/order'
DZEN_URL = 'https://dzen.ru/?yredirect=true'

# Answers

ANSWER_1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
ANSWER_2 = ('Пока что у нас так: один заказ — один самокат. '
            'Если хотите покататься с друзьями, '
            'можете просто сделать несколько заказов — один за другим.')
ANSWER_3 = ('Допустим, вы оформляете заказ на 8 мая. '
            'Мы привозим самокат 8 мая в течение дня. '
            'Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. '
            'Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.')
ANSWER_4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
ANSWER_5 = ('Пока что нет! Но если что-то срочное — '
            'всегда можно позвонить в поддержку по красивому номеру 1010.')
ANSWER_6 = ('Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток'
            ' — даже если будете кататься без передышек и во сне. Зарядка не понадобится.')
ANSWER_7 = ('Да, пока самокат не привезли. '
            'Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.')
ANSWER_8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

# Order form inputs

NAME_1 = 'Василий'
SURNAME_1 = 'Иванов'
ADDRESS_1 = 'Невский пр, 46'
TELEPHONE_NUMBER_1 = '+79998887766'
CELL_1 = 23
COMMENT_1 = 'Хочу бесплатный самокат'

NAME_2 = 'Олег'
SURNAME_2 = 'Петров'
ADDRESS_2 = 'Ленинградский пр, 123'
TELEPHONE_NUMBER_2 = '+78887776655'
CELL_2 = 30
COMMENT_2 = 'Хочу 10 самокатов'

ORDER_DONE_TEXT = "Заказ оформлен"
